In [1]:
import sqlite3 as sql

# Read data from database

In [2]:
connection=sql.connect('weather.db')
cursor=connection.cursor()
cursor.execute('SELECT * FROM users ')
rows=cursor.fetchall()
connection.close()

In [3]:
rows

[(3, 'eman', 'Giza', 20),
 (12, 'Eslam Ahmed', 'Cairo', 20),
 (15, 'hamada', 'Cairo', 22),
 (19, 'Medhat', 'Maadi', 22),
 (22, 'Menna', 'Cairo', 22),
 (23, 'Ezz', 'Giza', 22),
 (25, 'Menna', 'Cairo', 22),
 (26, 'Ebrahem', 'Giza', 35)]

In [4]:
for Id,name,city,age in rows:
    print(f'the id is {Id} , the name is {name} , the city is {city} , the age is {age}')

the id is 3 , the name is eman , the city is Giza , the age is 20
the id is 12 , the name is Eslam Ahmed , the city is Cairo , the age is 20
the id is 15 , the name is hamada , the city is Cairo , the age is 22
the id is 19 , the name is Medhat , the city is Maadi , the age is 22
the id is 22 , the name is Menna , the city is Cairo , the age is 22
the id is 23 , the name is Ezz , the city is Giza , the age is 22
the id is 25 , the name is Menna , the city is Cairo , the age is 22
the id is 26 , the name is Ebrahem , the city is Giza , the age is 35

# Use panda to read database and execute SQl

In [5]:
import pandas as pd

In [6]:
connection=sql.connect('weather.db')
df=pd.read_sql('SELECT * FROM users',connection)
connection.close()
df.head()

   id         name   city  age
0   3         eman   Giza   20
1  12  Eslam Ahmed  Cairo   20
2  15       hamada  Cairo   22
3  19       Medhat  Maadi   22
4  22        Menna  Cairo   22

In [7]:
query=input('Enter the city:')
connection=sql.connect('weather.db')
cursor=connection.cursor()
cursor.execute('SELECT * FROM users WHERE city = ?', [query])
data=cursor.fetchall()
connection.close()
for i,n,c,a in data:
    print(f'User\'s id {i} and dis name is {n} he living in {c} and his age is {a}')

Enter the city:Cairo
User's id 12 and dis name is Eslam Ahmed he living in Cairo and his age is 20
User's id 15 and dis name is hamada he living in Cairo and his age is 22
User's id 22 and dis name is Menna he living in Cairo and his age is 22
User's id 25 and dis name is Menna he living in Cairo and his age is 22

# Insert Data into Database (Create)

In [8]:
connection=sql.connect('weather.db')
cursor=connection.cursor()
cursor.execute('INSERT INTO users (name,age,city) VALUES (?,?,?)', ['yahya',21,'Cairo'])
connection.commit()
connection.close()
cursor.lastrowid

27

In [9]:
connection=sql.connect('weather.db')
cursor=connection.cursor()
cursor.execute('INSERT INTO users (name,age,city) VALUES (?,?,?)',['hady',44,'lebnan'])
connection.commit()
connection.close()
cursor.lastrowid

28

In [10]:
name=input('Enter your name:')
age=input('Enter your age:')
city=input('Enter your city:')
connection=sql.connect('weather.db')
cursor=connection.cursor()
cursor.execute('INSERT INTO users (name,age,city) VALUES(?,?,?)',[name,age,city])
connection.commit()
connection.close()
cursor.lastrowid

Enter your name:yahya
Enter your age:21
Enter your city:Cairo

29

# Update Data in database

In [11]:
connection=sql.connect('weather.db')
cursor=connection.cursor()
cursor.execute('UPDATE users SET name=?,age=?,city=? WHERE id =?',['yahya',22,'Cairo',28])
connection.commit()
connection.close()

# Delete Data in Database

In [12]:
connection=sql.connect('weather.db')
cursor=connection.cursor()
cursor.execute('DELETE FROM users WHERE age>=30')
connection.commit()
connection.close()

**read data aftre do delete process**

In [14]:
connection=sql.connect('weather.db')
cursor=connection.cursor()
df=pd.read_sql('SELECT * FROM users',connection)
connection.close()
df

   id         name   city  age
0   3         eman   Giza   20
1  12  Eslam Ahmed  Cairo   20
2  15       hamada  Cairo   22
3  19       Medhat  Maadi   22
4  22        Menna  Cairo   22
5  23          Ezz   Giza   22
6  25        Menna  Cairo   22
7  27        yahya  Cairo   21
8  28        yahya  Cairo   22
9  29        yahya  Cairo   21